Revit 2027 API
BuiltInFailures.RoomFailures.CannotMakeRoomsGeometry Property
 Could not create geometry for [Room].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMakeRoomsGeometry { get; }
Public Shared ReadOnly Property CannotMakeRoomsGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMakeRoomsGeometry {
	FailureDefinitionId^ get ();
}
static member CannotMakeRoomsGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace